tutorials/OutboundMessage/mod5/sampleoutboundmessage.txt

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
 <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
  <OrganizationId>00D30000000opwSEAQ</OrganizationId>
  <ActionId>04k30000000L6QPAA0</ActionId>
  <SessionId xsi:nil="true"/>
  <EnterpriseUrl>https://na1-api.salesforce.com/services/Soap/c/22.0/00D30000000opwS</EnterpriseUrl>
  <PartnerUrl>https://na1-api.salesforce.com/services/Soap/u/22.0/00D30000000opwS</PartnerUrl>
  <Notification>
   <Id>04l3000000JbKClAAN</Id>
   <sObject xsi:type="sf:Voter__c" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
    <sf:Contacted2016__c>true</sf:Contacted2016__c>
    <sf:Last_Contact_Date__c>09-22-2015</sf:Last_Contact_Date__c>
    <sf:Mailing_Address__c>25235 SE Klahanie Blvd, Issaquah, WA 98029</sf:Mailing_Address__c>
    <sf:Name>Bill Gates</sf:Name>
   </sObject>
  </Notification>
 </notifications>
 </soapenv:Body>
</soapenv:Envelope>