tests/sampleNotification.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
            <OrganizationId>00D8A0000009WNNUA2</OrganizationId>
            <ActionId>04k8A00000000ZfQAI</ActionId>
            <SessionId>00D8A0000009WNN!ARwAQK5Z9rQ18KUzUdZzunHPVs.8e8oziLo4YUHuvJY7ne18E0adL3I4xVBBREdLzabNq51bMt02KVEgl0WEc2AeQMUJ6fqR</SessionId>
            <EnterpriseUrl>https://improveit360-79--sb.cloudforce.com/services/Soap/c/46.0/00D8A0000009WNN</EnterpriseUrl>
            <PartnerUrl>https://improveit360-79--sb.cloudforce.com/services/Soap/u/46.0/00D8A0000009WNN</PartnerUrl>
            <Notification>
                <Id>04l8A000006mrLRQAY</Id>
                <sObject xsi:type="sf:i360__Appointment__c" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
                    <sf:Id>FAKER_UUID</sf:Id>
                    <sf:i360__Address__c>FAKER_ADDRESS</sf:i360__Address__c>
                    <sf:i360__City__c>FAKER_CITY</sf:i360__City__c>
                    <sf:i360__Lead_Source__c>FAKER_SOURCE</sf:i360__Lead_Source__c>
                    <sf:i360__Email_Address__c>FAKER_EMAIL</sf:i360__Email_Address__c>
                    <sf:i360__Components__c>SERVICE_NAME</sf:i360__Components__c>
                    <sf:i360__Prospect_Name__c>FAKER_LAST_FIRST</sf:i360__Prospect_Name__c>
                    <sf:i360__Prospect__c>FAKER_PROSPECT_ID</sf:i360__Prospect__c>
                    <sf:i360__Sales_Rep_1__c>SALES_REP_SALESFORCE_ID</sf:i360__Sales_Rep_1__c>
                    <sf:i360__StartDateTime__c>START_DATE_TIME</sf:i360__StartDateTime__c>
                    <sf:i360__State__c>FAKER_STATE_ABBREV</sf:i360__State__c>
                    <sf:i360__Type__c>New</sf:i360__Type__c>
                    <sf:i360__Zip__c>FAKER_ZIP</sf:i360__Zip__c>
                </sObject>
            </Notification>
        </notifications>
    </soapenv:Body>
</soapenv:Envelope>
