vlocity/DataRaptor/VPLExpectedMeterRangeXMLtoJSON/VPLExpectedMeterRangeXMLtoJSON_SampleInputXML.xml

<?xml version="1.0"?>
<soapenv:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <notifications
            xmlns="http://soap.sforce.com/2005/09/outbound">
            <Notification>
                <sObject
                    xmlns:sf="urn:sobject.enterprise.soap.sforce.com" xsi:type="sf:Account">
                    <sf:MeterReadingDate>03-20-2020
                    </sf:MeterReadMonth1>
                    <sf:Meter_Serial_Number__c>3422323</sf:Meter_Serial_Number__c>
                    <sf:PROD_Utility_Type__c>Electricity</sf:PROD_Utility_Type__c>
                    <sf:ExpctedLowValue>11955</sf:ExpctedLowValue>
                    <sf:ExpctedHighValue>12565</sf:ExpctedHighValue>
                </sObject>
                <sObject
                    xmlns:sf="urn:sobject.enterprise.soap.sforce.com" xsi:type="sf:Account">
                    <sf:MeterReadingDate>04-20-2020</sf:MeterReadingDate>
                    <sf:Meter_Serial_Number__c>5464564</sf:Meter_Serial_Number__c>
                    <sf:PROD_Utility_Type__c>Electricity</sf:PROD_Utility_Type__c>
                    <sf:ExpctedLowValue>12964</sf:ExpctedLowValue>
                    <sf:ExpctedHighValue>13233</sf:ExpctedHighValue>
                </sObject>
            </Notification>
            <OrganizationId>00Df2000000NVjK</OrganizationId>
            <PartnerUrl>https://accenture-utilities--UIDev.cs5.my.salesforce.com/services/Soap/u/41.0/00Df2000000NVjK</PartnerUrl>
            <EnterpriseUrl>https://accenture-utilities--UIDev.cs5.my.salesforce.com/services/Soap/c/41.0/00Df2000000NVjK</EnterpriseUrl>
            <SessionId xsi:nil="true"></SessionId>
        </notifications>
    </soapenv:Body>
</soapenv:Envelope>